class SymbolCategory {
  final String name;
  final List<String> symbols;

  SymbolCategory({
    required this.name,
    required this.symbols,
  });
}

class SymbolsData {
  static List<SymbolCategory> get categories => [
        SymbolCategory(
          name: 'Crown 👑',
          symbols: ['👑', '♕', '♚', '♛', '𓎵', '𓎶', '𓎷', '𓎸', '𓎹', '𓎺', '𓎻', '𓎼', '𓎽', '𓎾', '𓎿', '𓏀', '𓏁', '𓏂'],
        ),
        SymbolCategory(
          name: 'Stars ⭐',
          symbols: ['★', '☆', '✦', '✧', '✩', '✪', '✫', '✬', '✭', '✮', '✯', '✰', '☄', '𓇽', '🌌', '✴', '✳', '✵', '✶', '✷', '✸', '✹'],
        ),
        SymbolCategory(
          name: 'Hearts ❤️',
          symbols: ['❤', '🖤', '🤍', '🤎', '💛', '💚', '💙', '💜', '🧡', '💞', '💕', '❣', '❣', '♥', '♡', 'ღ', '❦', '❧', '☙', '𓆩♡𓆪', '𓆩♥𓆪'],
        ),
        SymbolCategory(
          name: 'Weapons ⚔️',
          symbols: ['⚔', '🔫', '💣', '🛡', '🏹', '🗡', '⚔️', '𓌜', '𓌝', '𓌞', '𓌟', '𓌠', '𓌡', '𓌢', '𓌣', '𓌤', '𓌥', '𓌦', '𓌧', '𓌨', '𓌩', '𓌪', '𓌫', '𓌬', '𓌭', '𓌮', '𓌯', '𓌰', '𓌱', '𓌲', '𓌳', '𓌴', '𓌵', '𓌶', '𓌷', '𓌸', '𓌹', '𓌺', '𓌻', '𓌼', '𓌽', '𓌾', '𓌿'],
        ),
        SymbolCategory(
          name: 'Flowers 🌸',
          symbols: ['🌸', '💮', '🌹', '🌺', '🌻', '🌼', '🌷', '🌿', '☘', '🍀', '🍁', '🍂', '🍃', '🏵', '⚜', '⚘', '✿', '❀', '❁', '❂', '❃'],
        ),
        SymbolCategory(
          name: 'Arrows ➔',
          symbols: ['➔', '➘', '➙', '➚', '➛', '➜', '➝', '➞', '➟', '➠', '➡', '➢', '➣', '➤', '➥', '➦', '➧', '➨', '➩', '➪', '➫', '➬', '➭', '➮', '➯', '➱', '➲', '➳', '➴', '➵', '➶', '➷', '➸', '🏹', '➵', '➴', '➶', '➽', '➾', '➔', '↔', '↕', '↖', '↗', '↘', '↙', '↚', '↛', '↜', '↝', '↩', '↪', '↫', '↬', '↭', '↮', '↯'],
        ),
        SymbolCategory(
          name: 'Japanese/Korean 💮',
          symbols: ['乂', '亗', 'シ', 'ツ', 'ヅ', '彡', '☯', 'の', 'も', 'ヤ', 'チ', 'タ', 'テ', 'ト', 'ニ', 'ハ', 'ホ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヲ', 'ン', '🌸', '💮', '🎎', '🎏', '🎐', '🎑', '🎒', '🎓', '🎏'],
        ),
        SymbolCategory(
          name: 'Boxes █',
          symbols: ['░', '▒', '▓', '█', '▄', '▀', '▌', '▐', '■', '□', '▢', '▣', '▤', '▥', '▦', '▧', '▨', '▩', '▪', '▫', '▬', '▭', '▮', '▯', '▰', '▱', '▲', '△', '▴', '▵', '▶', '▷', '▸', '▹', '►', '▻', '▼', '▽', '▾', '▿', '◀', '◁', '◂', '◃', '◄', '◄', '◄', '◄', '◄'],
        ),
        SymbolCategory(
          name: 'Greek 𝛀',
          symbols: ['α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'σ', 'τ', 'υ', 'φ', 'χ', 'ψ', 'ω', 'Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Ｔ', 'Υ', 'Φ', 'Χ', 'Ψ', 'Ω'],
        ),
        SymbolCategory(
          name: 'Music 🎵',
          symbols: ['🎵', '🎶', '🎼', '🎹', '🎻', '🎸', '🎺', '🎷', '🎤', '🎧', '📻', '🎙️', '🎶', '♩', '♪', '♫', '♬', '♭', '♮', '♯', '𝄞', '𝄢', '𝄡'],
        ),
        SymbolCategory(
          name: 'Zodiac ♈',
          symbols: ['♈', '♉', '♊', '♋', '♌', '♍', '♎', '♏', '♐', '♑', '♒', '♓'],
        ),
      ];
}
